Revit 2024 API
BuiltInFailures.DirectShapeFailures Class
 Failure definitions related to DirectShapes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class DirectShapeFailures
Visual Basic
Public NotInheritable Class DirectShapeFailures
Visual C++
public ref class DirectShapeFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures
See Also
BuiltInFailures.DirectShapeFailures Members
Autodesk.Revit.DB Namespace